MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : 42dB DSP Engine - I2S Audio Processor with BLE Control
 * @author         : Robin Kluit
 * @date           : 2026-02-04
 ******************************************************************************
 * @attention
 *
 * DSP audio processor: I2S input -> DSP processing -> I2S output
 * Control interface via ESP32 BLE GATT
 *
 * Peripherals:
 *   USART3 (Debug Console - ST-LINK VCP): PD8(TX), PD9(RX) @ 115200
 *   USART2 (ESP32 BLE Control): PD5(TX), PD6(RX) @ 115200
 *   SAI2_A (I2S Input from BM83): PD13(SCK), PD12(FS), PD11(SD) - Slave RX
 *   SAI2_B (I2S Output to DAC): PA0(SD) - Slave TX synced to SAI2_A
 *
 ******************************************************************************
 */

#include "stm32h7xx_hal.h"
#include "build_number.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

/* Audio Configuration -------------------------------------------------------*/
#define AUDIO_SAMPLE_RATE       44100   /* Match ESP32 default */
#define AUDIO_BIT_DEPTH         16      /* 16-bit audio */
#define AUDIO_CHANNELS          2
#define AUDIO_BUFFER_SAMPLES    256     /* Samples per channel per half-buffer */
#define AUDIO_BUFFER_SIZE       (AUDIO_BUFFER_SAMPLES * AUDIO_CHANNELS)  /* Total samples per half */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart2;  // ESP32 communication
UART_HandleTypeDef huart3;  // Debug console (VCP)
SAI_HandleTypeDef hsai_rx;  // SAI2_A - I2S Input (Slave RX)
SAI_HandleTypeDef hsai_tx;  // SAI2_B - I2S Output (Slave TX)
DMA_HandleTypeDef hdma_sai_rx;  // DMA for SAI2_A RX
DMA_HandleTypeDef hdma_sai_tx;  // DMA for SAI2_B TX

/* Audio Buffers - placed in D2 SRAM for DMA1/DMA2 access --------------------*/
/* IMPORTANT: DMA1/DMA2 on STM32H7 can ONLY access D2 SRAM (0x30000000)! */
/* Double buffer: DMA fills one half while we process the other */
/* 16-bit samples to match ESP32 I2S format */
__attribute__((section(".RAM_D2"))) int16_t audio_rx_buffer[AUDIO_BUFFER_SIZE * 2];
__attribute__((section(".RAM_D2"))) int16_t audio_tx_buffer[AUDIO_BUFFER_SIZE * 2];

/* Audio state */
volatile uint8_t audio_rx_half_complete = 0;
volatile uint8_t audio_rx_full_complete = 0;
volatile uint32_t audio_buffer_count = 0;
volatile uint32_t audio_overrun_count = 0;

/* Ring buffer for received data */
#define RX_BUFFER_SIZE 256
uint8_t rx_buffer[RX_BUFFER_SIZE];
volatile uint16_t rx_head = 0;
volatile uint16_t rx_tail = 0;
uint8_t rx_byte;  // Single byte for UART interrupt

/* Line buffer for GATT commands from ESP32 */
#define LINE_BUFFER_SIZE 128
char line_buffer[LINE_BUFFER_SIZE];
uint16_t line_pos = 0;

/* GATT command handler - called when complete line received */
static void Process_GATT_Command(const char *line);

/* ==========================================================================
 * DSP Processing State
 * ========================================================================== */

/* DSP feature flags */
static volatile uint8_t dsp_loudness_enabled = 0;
static volatile uint8_t dsp_mute_enabled = 0;
static volatile uint8_t dsp_bypass_enabled = 0;
static volatile uint8_t dsp_bass_boost_enabled = 0;
static volatile uint8_t dsp_duck_enabled = 0;
static volatile uint8_t dsp_normalizer_enabled = 0;

/* ==========================================================================
 * Presets (EQ profiles)
 * 0 = OFFICE: Neutral with slight high clarity
 * 1 = FULL: Enhanced bass and treble ("fun" curve)
 * 2 = NIGHT: Reduced bass, volume capped at 60%
 * 3 = SPEECH: Voice clarity, high-pass + mid boost
 * ========================================================================== */
typedef enum {
    PRESET_OFFICE = 0,
    PRESET_FULL   = 1,
    PRESET_NIGHT  = 2,
    PRESET_SPEECH = 3
} DspPreset;

static volatile uint8_t current_preset = PRESET_OFFICE;
#define PRESET_NIGHT_VOLUME_CAP 60  /* Max trim for NIGHT mode */

/* ==========================================================================
 * Volume / Device Trim
 * ==========================================================================
 * Device Trim is separate from phone volume (hardware buttons).
 * Used for: headroom management, safe caps, ducking, protection.
 *
 * Mapping (perceptual/logarithmic):
 *   100 →  0 dB (unity)
 *    80 → -6 dB
 *    60 → -12 dB
 *    40 → -20 dB
 *    20 → -35 dB
 *     0 → -60 dB (near-mute)
 * ========================================================================== */

static volatile uint8_t device_trim_value = 100; /* 0-100, default unity (0dB) */
static float current_gain = 0.3548f;             /* Current gain (smoothed) */
static float target_gain = 0.3548f;              /* Target gain from trim value */

/* Fixed headroom to accommodate all DSP effects without volume jumps
 * -9dB provides room for:
 *   - Loudness: +6dB bass boost
 *   - Bass Boost: +6-8dB
 *   - Combined effects with some margin
 * This headroom is ALWAYS applied, so enabling/disabling effects
 * doesn't cause perceived volume changes (effects "fill" the headroom)
 */
#define FIXED_HEADROOM_DB   -9.0f
#define FIXED_HEADROOM_LIN  0.3548f  /* 10^(-9/20) */

/* Smooth ramping coefficient (~10ms ramp @ 44.1kHz with 256 sample buffers) */
#define GAIN_RAMP_COEFF     0.05f

/**
 * @brief  Convert trim value (0-100) to linear gain
 *         Uses piecewise linear approximation of logarithmic curve
 *         Includes fixed headroom for DSP effects
 */
static float trim_to_gain(uint8_t trim)
{
    /* Piecewise linear dB mapping, then convert to linear */
    float db;
    if (trim >= 100) {
        db = 0.0f;
    } else if (trim >= 80) {
        /* 100→0dB, 80→-6dB: slope = -6/20 = -0.3 dB per unit */
        db = (trim - 100) * 0.3f;
    } else if (trim >= 60) {
        /* 80→-6dB, 60→-12dB: slope = -6/20 = -0.3 dB per unit */
        db = -6.0f + (trim - 80) * 0.3f;
    } else if (trim >= 40) {
        /* 60→-12dB, 40→-20dB: slope = -8/20 = -0.4 dB per unit */
        db = -12.0f + (trim - 60) * 0.4f;
    } else if (trim >= 20) {
        /* 40→-20dB, 20→-35dB: slope = -15/20 = -0.75 dB per unit */
        db = -20.0f + (trim - 40) * 0.75f;
    } else {
        /* 20→-35dB, 0→-60dB: slope = -25/20 = -1.25 dB per unit */
        db = -35.0f + (trim - 20) * 1.25f;
    }

    /* Add fixed headroom and convert dB to linear */
    db += FIXED_HEADROOM_DB;
    return powf(10.0f, db / 20.0f);
}

/**
 * @brief  Calculate target gain from trim value
 *         Headroom is fixed, not dependent on active effects
 *         NIGHT preset applies volume cap
 */
static void update_target_gain(void)
{
    uint8_t effective_trim = device_trim_value;

    /* Apply volume cap for NIGHT mode */
    if (current_preset == PRESET_NIGHT && effective_trim > PRESET_NIGHT_VOLUME_CAP) {
        effective_trim = PRESET_NIGHT_VOLUME_CAP;
    }

    target_gain = trim_to_gain(effective_trim);
}

