MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
/* Biquad filter state for loudness (stereo - L and R channels) */
/* Low-shelf filter: boost bass frequencies (+6dB @ 100Hz) */
typedef struct {
    float x1, x2;  /* Input history */
    float y1, y2;  /* Output history */
} BiquadState;

static BiquadState loudness_state_L = {0};
static BiquadState loudness_state_R = {0};

/* Biquad coefficients for low-shelf filter
 * Calculated for: Fs=44100Hz, Fc=150Hz, Gain=+6dB, Q=0.707
 * Using Audio EQ Cookbook formula (Robert Bristow-Johnson) */
static const float loudness_b0 = 1.005260f;
static const float loudness_b1 = -1.974408f;
static const float loudness_b2 = 0.969786f;
static const float loudness_a1 = -1.974567f;
static const float loudness_a2 = 0.974887f;

/* ==========================================================================
 * Bass Boost Filter (+8dB @ 100Hz)
 * ========================================================================== */
static BiquadState bass_state_L = {0};
static BiquadState bass_state_R = {0};

/* Bass Boost: Low-shelf +8dB @ 100Hz, S=0.7 */
static const float bass_b0 = 1.005677f;
static const float bass_b1 = -1.980528f;
static const float bass_b2 = 0.975169f;
static const float bass_a1 = -1.980624f;
static const float bass_a2 = 0.980750f;

/* ==========================================================================
 * Duck Mode (-12dB gain reduction)
 * ========================================================================== */
#define DUCK_GAIN_LIN       0.251189f  /* 10^(-12/20) = ~25% volume */
static float duck_current_gain = 1.0f;
static float duck_target_gain = 1.0f;

/* ==========================================================================
 * Normalizer / DRC (Dynamic Range Compression)
 * Tuned for transparent leveling without "pumping"
 * Threshold: -12dB (only compress loud parts)
 * Ratio: 2:1 (gentle compression)
 * Attack: 10ms, Release: 80ms (faster recovery)
 * Makeup: +3dB (subtle boost)
 * ========================================================================== */
#define DRC_THRESHOLD_LIN   0.251189f  /* 10^(-12/20) = -12dB */
#define DRC_RATIO           2.0f       /* Gentle 2:1 ratio */
#define DRC_ATTACK_COEF     0.002268f  /* ~10ms attack */
#define DRC_RELEASE_COEF    0.000284f  /* ~80ms release */
#define DRC_MAKEUP_LIN      1.412538f  /* +3dB makeup gain */

static float drc_envelope = 0.0f;      /* Current envelope level */
static float drc_gain_smooth = 1.0f;   /* Smoothed gain reduction */

/* ==========================================================================
 * Preset EQ Coefficients
 * ========================================================================== */

/* Preset filter states (up to 2 stages per preset) */
static BiquadState preset_eq1_L = {0};
static BiquadState preset_eq1_R = {0};
static BiquadState preset_eq2_L = {0};
static BiquadState preset_eq2_R = {0};

/* OFFICE: High-shelf +1.5dB @ 6kHz (subtle clarity) */
static const float preset_office_b0 = 1.128557f;
static const float preset_office_b1 = -0.947809f;
static const float preset_office_b2 = 0.264846f;
static const float preset_office_a1 = -0.762145f;
static const float preset_office_a2 = 0.207739f;

/* FULL: Low-shelf +4dB @ 120Hz */
static const float preset_full_bass_b0 = 1.003338f;
static const float preset_full_bass_b1 = -1.974175f;
static const float preset_full_bass_b2 = 0.971200f;
static const float preset_full_bass_a1 = -1.974242f;
static const float preset_full_bass_a2 = 0.974472f;
/* FULL: High-shelf +3dB @ 8kHz */
static const float preset_full_treble_b0 = 1.237922f;
static const float preset_full_treble_b1 = -0.692061f;
static const float preset_full_treble_b2 = 0.184899f;
static const float preset_full_treble_a1 = -0.383231f;
static const float preset_full_treble_a2 = 0.113991f;

/* NIGHT: Low-shelf -3dB @ 150Hz (reduced bass) */
static const float preset_night_b0 = 0.996892f;
static const float preset_night_b1 = -1.960843f;
static const float preset_night_b2 = 0.964328f;
static const float preset_night_a1 = -1.960765f;
static const float preset_night_a2 = 0.961297f;

/* SPEECH: High-pass @ 150Hz */
static const float preset_speech_hp_b0 = 0.985000f;
static const float preset_speech_hp_b1 = -1.969999f;
static const float preset_speech_hp_b2 = 0.985000f;
static const float preset_speech_hp_a1 = -1.969774f;
static const float preset_speech_hp_a2 = 0.970224f;
/* SPEECH: Mid boost +3dB @ 2.5kHz */
static const float preset_speech_mid_b0 = 1.036752f;
static const float preset_speech_mid_b1 = -1.707474f;
static const float preset_speech_mid_b2 = 0.785074f;
static const float preset_speech_mid_a1 = -1.707474f;
static const float preset_speech_mid_a2 = 0.821826f;

/* Apply biquad filter to a single sample (generic version) */
static inline float biquad_process_coef(BiquadState *state, float input,
                                        float b0, float b1, float b2,
                                        float a1, float a2)
{
    float output = b0 * input
                 + b1 * state->x1
                 + b2 * state->x2
                 - a1 * state->y1
                 - a2 * state->y2;

    /* Shift history */
    state->x2 = state->x1;
    state->x1 = input;
    state->y2 = state->y1;
    state->y1 = output;

    return output;
}

/* Loudness filter wrapper */
static inline float loudness_process(BiquadState *state, float input)
{
    return biquad_process_coef(state, input,
                               loudness_b0, loudness_b1, loudness_b2,
                               loudness_a1, loudness_a2);
}

/* Bass Boost filter wrapper */
static inline float bass_process(BiquadState *state, float input)
{
    return biquad_process_coef(state, input,
                               bass_b0, bass_b1, bass_b2,
                               bass_a1, bass_a2);
}

/* Preset EQ processing - applies preset-specific filters */
static inline void preset_process(float *left, float *right)
{
    switch (current_preset)
    {
        case PRESET_OFFICE:
            /* Single stage: subtle high-shelf */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_office_b0, preset_office_b1, preset_office_b2,
                        preset_office_a1, preset_office_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_office_b0, preset_office_b1, preset_office_b2,
                        preset_office_a1, preset_office_a2);
            break;

        case PRESET_FULL:
            /* Two stages: bass boost + treble boost */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_full_bass_b0, preset_full_bass_b1, preset_full_bass_b2,
                        preset_full_bass_a1, preset_full_bass_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_full_bass_b0, preset_full_bass_b1, preset_full_bass_b2,
                        preset_full_bass_a1, preset_full_bass_a2);
            *left  = biquad_process_coef(&preset_eq2_L, *left,
                        preset_full_treble_b0, preset_full_treble_b1, preset_full_treble_b2,
                        preset_full_treble_a1, preset_full_treble_a2);
            *right = biquad_process_coef(&preset_eq2_R, *right,
                        preset_full_treble_b0, preset_full_treble_b1, preset_full_treble_b2,
                        preset_full_treble_a1, preset_full_treble_a2);
            break;

        case PRESET_NIGHT:
            /* Single stage: reduced bass */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_night_b0, preset_night_b1, preset_night_b2,
                        preset_night_a1, preset_night_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_night_b0, preset_night_b1, preset_night_b2,
                        preset_night_a1, preset_night_a2);
            break;

