MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
        case PRESET_SPEECH:
            /* Two stages: high-pass + mid boost */
            *left  = biquad_process_coef(&preset_eq1_L, *left,
                        preset_speech_hp_b0, preset_speech_hp_b1, preset_speech_hp_b2,
                        preset_speech_hp_a1, preset_speech_hp_a2);
            *right = biquad_process_coef(&preset_eq1_R, *right,
                        preset_speech_hp_b0, preset_speech_hp_b1, preset_speech_hp_b2,
                        preset_speech_hp_a1, preset_speech_hp_a2);
            *left  = biquad_process_coef(&preset_eq2_L, *left,
                        preset_speech_mid_b0, preset_speech_mid_b1, preset_speech_mid_b2,
                        preset_speech_mid_a1, preset_speech_mid_a2);
            *right = biquad_process_coef(&preset_eq2_R, *right,
                        preset_speech_mid_b0, preset_speech_mid_b1, preset_speech_mid_b2,
                        preset_speech_mid_a1, preset_speech_mid_a2);
            break;
    }
}

/* Reset preset filter states (call when changing presets) */
static void reset_preset_filters(void)
{
    memset(&preset_eq1_L, 0, sizeof(preset_eq1_L));
    memset(&preset_eq1_R, 0, sizeof(preset_eq1_R));
    memset(&preset_eq2_L, 0, sizeof(preset_eq2_L));
    memset(&preset_eq2_R, 0, sizeof(preset_eq2_R));
}

/* DRC/Compressor process - returns smoothed gain factor */
static inline float drc_process(float input_level)
{
    /* Peak detection with attack/release envelope */
    float abs_level = (input_level < 0) ? -input_level : input_level;

    if (abs_level > drc_envelope) {
        /* Attack: fast rise */
        drc_envelope += DRC_ATTACK_COEF * (abs_level - drc_envelope);
    } else {
        /* Release: slow fall */
        drc_envelope += DRC_RELEASE_COEF * (abs_level - drc_envelope);
    }

    /* Calculate target gain */
    float target_drc_gain;
    if (drc_envelope > DRC_THRESHOLD_LIN) {
        /* Above threshold: apply compression */
        float excess_ratio = drc_envelope / DRC_THRESHOLD_LIN;
        float compressed = DRC_THRESHOLD_LIN * powf(excess_ratio, 1.0f / DRC_RATIO);
        target_drc_gain = (compressed / drc_envelope) * DRC_MAKEUP_LIN;
    } else {
        /* Below threshold: just apply makeup gain */
        target_drc_gain = DRC_MAKEUP_LIN;
    }

    /* Smooth the gain changes to avoid artifacts */
    drc_gain_smooth += 0.01f * (target_drc_gain - drc_gain_smooth);

    return drc_gain_smooth;
}

/* DMA drift detection and auto-recovery */
#define DMA_DRIFT_THRESHOLD     50      /* Max allowed drift in samples */
#define DMA_DRIFT_CHECK_INTERVAL 500    /* Check every 500ms */
static int16_t dma_initial_offset = 0;  /* Captured after startup */
static uint8_t dma_offset_captured = 0; /* Flag: initial offset valid */
static volatile uint32_t dma_resync_count = 0;  /* Total resyncs */

/**
 * @brief  Restart SAI/DMA to resynchronize RX and TX
 *         Called when DMA drift exceeds threshold
 */
static void SAI_DMA_Resync(void)
{
    /* Stop both DMA streams */
    HAL_SAI_DMAStop(&hsai_rx);
    HAL_SAI_DMAStop(&hsai_tx);

    /* Clear errors and flush FIFOs */
    __HAL_SAI_CLEAR_FLAG(&hsai_rx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    __HAL_SAI_CLEAR_FLAG(&hsai_tx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    SAI2_Block_A->CR2 |= SAI_xCR2_FFLUSH;
    SAI2_Block_B->CR2 |= SAI_xCR2_FFLUSH;

    /* Clear buffers */
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Restart DMA */
    HAL_SAI_Receive_DMA(&hsai_rx, (uint8_t *)audio_rx_buffer, AUDIO_BUFFER_SIZE * 2);
    HAL_SAI_Transmit_DMA(&hsai_tx, (uint8_t *)audio_tx_buffer, AUDIO_BUFFER_SIZE * 2);

    /* Reset drift tracking */
    dma_offset_captured = 0;
    dma_resync_count++;
}

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SAI2_Init(void);
void Error_Handler(void);

/* Audio processing */
static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples);

/* Debug printf redirection to USART3 */
int _write(int file, char *ptr, int len)
{
    HAL_UART_Transmit(&huart3, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();          // DMA must be initialized before peripherals that use it
    MX_USART3_UART_Init();  // Debug console first

    /* Boot message with build number */
    printf("\r\n\r\n*** 42dB DSP Engine (Build #%d) ***\r\n", BUILD_NUMBER);

    printf("[OK] HAL initialized\r\n");
    printf("[OK] Clock configured\r\n");
    printf("[OK] GPIO initialized\r\n");
    printf("[OK] DMA initialized\r\n");
    printf("[OK] USART3 (debug console) initialized\r\n");

    MX_USART2_UART_Init();  // ESP32 BLE control
    printf("[OK] USART2 (ESP32 BLE) initialized\r\n");

    MX_SAI2_Init();  // I2S Audio
    printf("[OK] SAI2 (I2S Audio) initialized\r\n");
    printf("[NOTE] Use 74HCT04 buffer for I2S signals (5V tolerant)\r\n");

    /* Print startup banner */
    printf("\r\n");
    printf("========================================\r\n");
    printf("42dB DSP Engine v0.2\r\n");
    printf("========================================\r\n");
    printf("ESP32 BLE: PD5(TX), PD6(RX) @ 115200\r\n");
    printf("Debug:     PD8(TX), PD9(RX) @ 115200\r\n");
    printf("I2S Input: PD13(SCK), PD12(FS), PD11(SD)\r\n");
    printf("I2S Output: PA0(SD)\r\n");
    printf("Audio:     %d Hz, %d ch, %d samples/buf\r\n",
           AUDIO_SAMPLE_RATE, AUDIO_CHANNELS, AUDIO_BUFFER_SAMPLES);
    printf("========================================\r\n\r\n");

    /* Start receiving data from ESP32 via interrupt */
    HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    printf("[OK] USART2 RX interrupt enabled\r\n");

    /* Clear audio buffers */
    memset(audio_rx_buffer, 0, sizeof(audio_rx_buffer));
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Clear any pending SAI errors and flush FIFOs before starting */
    __HAL_SAI_CLEAR_FLAG(&hsai_rx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    __HAL_SAI_CLEAR_FLAG(&hsai_tx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);

