MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    /* Flush FIFOs */
    SAI2_Block_A->CR2 |= SAI_xCR2_FFLUSH;
    SAI2_Block_B->CR2 |= SAI_xCR2_FFLUSH;

    /* Pre-fill TX buffer with silence to avoid garbage at startup */
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Start RX DMA first to receive audio data from ESP32/BM83 */
    HAL_StatusTypeDef rx_status = HAL_SAI_Receive_DMA(&hsai_rx, (uint8_t *)audio_rx_buffer,
                                                       AUDIO_BUFFER_SIZE * 2);

    /* Start TX DMA - synchronized to RX for same clock */
    HAL_StatusTypeDef tx_status = HAL_SAI_Transmit_DMA(&hsai_tx, (uint8_t *)audio_tx_buffer,
                                                        AUDIO_BUFFER_SIZE * 2);

    if (rx_status == HAL_OK && tx_status == HAL_OK)
    {
        printf("[OK] SAI2 RX+TX DMA started (passthrough mode)\r\n");
    }
    else
    {
        printf("[WARN] DMA start failed: RX=%d TX=%d\r\n", rx_status, tx_status);
    }

    printf("\r\n[INFO] PASSTHROUGH MODE - Audio from ESP32 to DAC\r\n");
    printf("       RX: BCLK->PD13, LRCK->PD12, SD->PD11\r\n");
    printf("       TX: SD->PA0 (shares BCLK/LRCK from ESP32)\r\n\r\n");

    /* Debug: print SAI and GPIO register status */
    printf("[DEBUG] SAI2_A CR1=0x%08lX SR=0x%08lX\r\n",
           SAI2_Block_A->CR1, SAI2_Block_A->SR);
    printf("[DEBUG] SAI2_B CR1=0x%08lX SR=0x%08lX\r\n",
           SAI2_Block_B->CR1, SAI2_Block_B->SR);
    /* GPIO mode and alternate function for PD11,12,13 */
    printf("[DEBUG] GPIOD MODER=0x%08lX AFR[1]=0x%08lX\r\n",
           GPIOD->MODER, GPIOD->AFR[1]);
    /* GPIO for PA0 (SAI2_B output) */
    printf("[DEBUG] GPIOA MODER=0x%08lX AFR[0]=0x%08lX\r\n",
           GPIOA->MODER, GPIOA->AFR[0]);
    /* Check SAI2 clock source */
    printf("[DEBUG] RCC D2CCIP1R=0x%08lX (SAI23SEL bits 8:6)\r\n",
           RCC->D2CCIP1R);
    /* Read GPIO input values to verify signals */
    printf("[DEBUG] GPIOD IDR=0x%04lX (PD11=%d PD12=%d PD13=%d)\r\n",
           GPIOD->IDR,
           (GPIOD->IDR >> 11) & 1,
           (GPIOD->IDR >> 12) & 1,
           (GPIOD->IDR >> 13) & 1);

    /* Variables for periodic status */
    uint32_t last_status_time = 0;
    uint32_t last_buffer_count = 0;
    uint32_t debug_counter = 0;
    uint32_t last_drift_check = 0;

    /* Infinite loop */
    while (1)
    {
        /* Audio processing happens in RX DMA callbacks for lowest latency */

        /* DMA drift detection - check every 500ms */
        uint32_t now = HAL_GetTick();
        if (now - last_drift_check >= DMA_DRIFT_CHECK_INTERVAL && audio_buffer_count > 100)
        {
            /* Read both NDTR as close together as possible */
            uint32_t rx_ndtr = DMA1_Stream0->NDTR;
            uint32_t tx_ndtr = DMA1_Stream1->NDTR;
            int16_t current_offset = (int16_t)(tx_ndtr - rx_ndtr);

            if (!dma_offset_captured)
            {
                /* Capture initial offset after startup/resync */
                dma_initial_offset = current_offset;
                dma_offset_captured = 1;
            }
            else
            {
                /* Check drift from initial offset (handle wrap-around) */
                int16_t drift = current_offset - dma_initial_offset;
                if (drift > 512) drift -= 1024;
                if (drift < -512) drift += 1024;

                if (drift > DMA_DRIFT_THRESHOLD || drift < -DMA_DRIFT_THRESHOLD)
                {
                    printf("[RESYNC] DMA drift=%d (threshold=%d), restarting SAI/DMA (resync #%lu)\r\n",
                           drift, DMA_DRIFT_THRESHOLD, dma_resync_count + 1);
                    SAI_DMA_Resync();
                }
            }
            last_drift_check = now;
        }

        /* Print status every second */
        if (now - last_status_time >= 1000)
        {
            uint32_t buffers_per_sec = audio_buffer_count - last_buffer_count;
            if (audio_buffer_count > 0)
            {
                printf("[AUDIO] Buffers/sec: %lu, Total: %lu, Overruns: %lu, Resyncs: %lu\r\n",
                       buffers_per_sec, audio_buffer_count, audio_overrun_count, dma_resync_count);
            }
            /* Debug: show SAI and DMA status every 5 seconds */
            debug_counter++;
            if ((debug_counter % 5) == 0)
            {
                /* Read NDTR close together for accurate offset */
                uint32_t rx_ndtr = DMA1_Stream0->NDTR;
                uint32_t tx_ndtr = DMA1_Stream1->NDTR;
                int16_t offset = (int16_t)(tx_ndtr - rx_ndtr);
                int16_t drift = offset - dma_initial_offset;
                if (drift > 512) drift -= 1024;
                if (drift < -512) drift += 1024;

                printf("[DEBUG] SAI_A: SR=0x%lX CR1=0x%08lX\r\n",
                       SAI2_Block_A->SR, SAI2_Block_A->CR1);
                printf("[DEBUG] SAI_B: SR=0x%lX CR1=0x%08lX\r\n",
                       SAI2_Block_B->SR, SAI2_Block_B->CR1);
                printf("[DEBUG] DMA RX NDTR=%lu, TX NDTR=%lu, offset=%d, drift=%d\r\n",
                       rx_ndtr, tx_ndtr, offset, drift);
                extern volatile uint32_t audio_process_count;
                printf("[DEBUG] RX[0..3]: %d %d %d %d\r\n",
                       audio_rx_buffer[0], audio_rx_buffer[1],
                       audio_rx_buffer[2], audio_rx_buffer[3]);
                printf("[DEBUG] TX[0..3]: %d %d %d %d\r\n",
                       audio_tx_buffer[0], audio_tx_buffer[1],
                       audio_tx_buffer[2], audio_tx_buffer[3]);
                printf("[DEBUG] Process=%lu\r\n", audio_process_count);
            }
            last_buffer_count = audio_buffer_count;
            last_status_time = now;
        }

        /* Process ESP32 UART data - accumulate into line buffer */
        while (rx_head != rx_tail)
        {
            uint8_t data = rx_buffer[rx_tail];
            rx_tail = (rx_tail + 1) % RX_BUFFER_SIZE;

            if (data == '\n')
            {
                /* End of line - process command */
                line_buffer[line_pos] = '\0';
                if (line_pos > 0 && line_buffer[line_pos - 1] == '\r')
                {
                    line_buffer[line_pos - 1] = '\0';  /* Remove \r */
                }
                if (line_pos > 0)
                {
                    Process_GATT_Command(line_buffer);
                }
                line_pos = 0;
            }
            else if (line_pos < LINE_BUFFER_SIZE - 1)
            {
                line_buffer[line_pos++] = (char)data;
            }
        }

