MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
        /* Small delay to prevent tight loop when no audio */
        HAL_Delay(1);
    }
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /** Supply configuration update enable
     */
    HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

    /** Configure the main internal regulator output voltage
     */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

    while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

    /** Initializes the RCC Oscillators according to the specified parameters
     * in the RCC_OscInitTypeDef structure.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 1;
    RCC_OscInitStruct.PLL.PLLN = 120;
    RCC_OscInitStruct.PLL.PLLP = 2;
    RCC_OscInitStruct.PLL.PLLQ = 2;
    RCC_OscInitStruct.PLL.PLLR = 2;
    RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
    RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
    RCC_OscInitStruct.PLL.PLLFRACN = 0;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                                |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
    RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief USART2 Initialization Function (ESP32 Communication)
 * @param None
 * @retval None
 */
static void MX_USART2_UART_Init(void)
{
    huart2.Instance = USART2;
    huart2.Init.BaudRate = 115200;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart2.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&huart2) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief USART3 Initialization Function (Debug Console / VCP)
 * @param None
 * @retval None
 */
static void MX_USART3_UART_Init(void)
{
    huart3.Instance = USART3;
    huart3.Init.BaudRate = 115200;
    huart3.Init.WordLength = UART_WORDLENGTH_8B;
    huart3.Init.StopBits = UART_STOPBITS_1;
    huart3.Init.Parity = UART_PARITY_NONE;
    huart3.Init.Mode = UART_MODE_TX_RX;
    huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart3.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&huart3) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief DMA Initialization Function
 * @param None
 * @retval None
 */
static void MX_DMA_Init(void)
{
    /* DMA controller clock enable */
    __HAL_RCC_DMA1_CLK_ENABLE();

    /* DMA interrupt init */
    /* Audio DMA at lower priority (2) so UART can interrupt */
    /* DMA1_Stream0_IRQn - SAI2_A RX */
    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
    /* DMA1_Stream1_IRQn - SAI2_B TX */
    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);

    /* UART2 interrupt at highest priority (0) for reliable command reception */
    HAL_NVIC_SetPriority(USART2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

/**
 * @brief SAI2 Initialization Function (I2S Audio Input/Output)
 *
 * SAI2_A: Slave Receiver - receives I2S from BM83
 *   - Pins: PD13 (SCK), PD12 (FS), PD11 (SD)
 *   - Mode: Slave, receives clock from BM83 (external master)
 *
 * SAI2_B: Slave Transmitter - outputs I2S to DAC
 *   - Pin: PA0 (SD)
 *   - Mode: Synchronous slave to SAI2_A (shares clock)
 *
 * @param None
 * @retval None
 */
static void MX_SAI2_Init(void)
{
    /* -------- SAI2 Block A - Slave Receiver (I2S Input) -------- */
    /* Using FREE protocol for full control over I2S timing */
    hsai_rx.Instance = SAI2_Block_A;
    hsai_rx.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai_rx.Init.AudioMode = SAI_MODESLAVE_RX;
    hsai_rx.Init.DataSize = SAI_DATASIZE_16;
    hsai_rx.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai_rx.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
    hsai_rx.Init.Synchro = SAI_ASYNCHRONOUS;
    hsai_rx.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
    hsai_rx.Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;
    hsai_rx.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;
    hsai_rx.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_44K;
    hsai_rx.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    hsai_rx.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai_rx.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai_rx.Init.TriState = SAI_OUTPUT_NOTRELEASED;

    /* Frame: 32 bits total (16 left + 16 right), I2S Philips style */
    hsai_rx.FrameInit.FrameLength = 32;
    hsai_rx.FrameInit.ActiveFrameLength = 16;
    hsai_rx.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai_rx.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai_rx.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Slots: 2 x 16-bit */
    hsai_rx.SlotInit.FirstBitOffset = 0;
    hsai_rx.SlotInit.SlotSize = SAI_SLOTSIZE_16B;
    hsai_rx.SlotInit.SlotNumber = 2;
    hsai_rx.SlotInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

    if (HAL_SAI_Init(&hsai_rx) != HAL_OK)
    {
        Error_Handler();
    }

    /* Disable ALL error interrupts - in slave mode we trust external sync */
    __HAL_SAI_DISABLE_IT(&hsai_rx, SAI_IT_OVRUDR | SAI_IT_AFSDET | SAI_IT_LFSDET | SAI_IT_WCKCFG);
    __HAL_SAI_DISABLE_IT(&hsai_tx, SAI_IT_OVRUDR | SAI_IT_AFSDET | SAI_IT_LFSDET | SAI_IT_WCKCFG);

    /* -------- SAI2 Block B - Slave Transmitter (I2S Output) -------- */
    /* Synchronized to Block A */
    hsai_tx.Instance = SAI2_Block_B;
    hsai_tx.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai_tx.Init.AudioMode = SAI_MODESLAVE_TX;
    hsai_tx.Init.DataSize = SAI_DATASIZE_16;
    hsai_tx.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai_tx.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
    hsai_tx.Init.Synchro = SAI_SYNCHRONOUS;
    hsai_tx.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLE;
    hsai_tx.Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;
    hsai_tx.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;
    hsai_tx.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_44K;
    hsai_tx.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    hsai_tx.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai_tx.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai_tx.Init.TriState = SAI_OUTPUT_NOTRELEASED;

